#coding:utf-8

# 所有结果数据存放的总文件
allFilePath = "D:/temp4/"

# 矢量数据目录
shpFile = "D:/实验数据/数据库/2013/230624杜尔伯特蒙古族自治县(2013)土地调查变更后数据库.mdb/DLG_地籍信息_G_230624/DLTB_G_230624"
# 影像数据目录
rasterFile = "D:/实验数据/影像/2013/20130023062401杜尔伯特蒙古族自治县/2306242013SPOT5DOM.img"

# 地类字段名称
field = "DLMC" # 字段名——地类名称
# 地类总数
R = 31

# 所需要切割影像的类别
classFileName = [u"坑塘水面",u"有林地",u"其他林地",u"旱地",u"水浇地",u"其他草地",u"盐碱地",u"村庄",u"天然牧草地",u"水田",u"沼泽地",u"河流水面",u"裸地",u"设施农用地",u"果园",u"风景名胜及特殊用地",u"沟渠",u"人工牧草地",u"采矿用地",u"农村道路",u"内陆滩涂",u"灌木林地",u"铁路用地",u"水工建筑用地",u"建制镇",u"公路用地",u"湖泊水面",u"管道运输用地",u"水库水面",u"其他园地",u"沙地"]#类别
className = ["坑塘水面","有林地","其他林地","旱地","水浇地","其他草地","盐碱地","村庄","天然牧草地","水田","沼泽地","河流水面","裸地","设施农用地","果园","风景名胜及特殊用地","沟渠","人工牧草地","采矿用地","农村道路","内陆滩涂","灌木林地","铁路用地","水工建筑用地","建制镇","公路用地","湖泊水面","管道运输用地","水库水面","其他园地","沙地"]#类别

#影像的年份
year = 2013
# 影像的月份
month = 0